{
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "dtype": "float32", "shape": [3, 3, 3, 16], "name": "conv2d/kernel" },
        { "dtype": "float32", "shape": [16], "name": "conv2d/bias" },
        {
          "dtype": "float32",
          "shape": [3, 3, 16, 32],
          "name": "conv2d_1/kernel"
        },
        { "dtype": "float32", "shape": [32], "name": "conv2d_1/bias" },
        {
          "dtype": "float32",
          "shape": [3, 3, 32, 64],
          "name": "conv2d_2/kernel"
        },
        { "dtype": "float32", "shape": [64], "name": "conv2d_2/bias" },
        {
          "dtype": "float32",
          "shape": [3, 3, 64, 64],
          "name": "conv2d_3/kernel"
        },
        { "dtype": "float32", "shape": [64], "name": "conv2d_3/bias" },
        {
          "dtype": "float32",
          "shape": [3, 3, 64, 64],
          "name": "conv2d_4/kernel"
        },
        { "dtype": "float32", "shape": [64], "name": "conv2d_4/bias" },
        { "dtype": "float32", "shape": [1024, 512], "name": "dense/kernel" },
        { "dtype": "float32", "shape": [512], "name": "dense/bias" },
        { "dtype": "float32", "shape": [512, 1], "name": "dense_1/kernel" },
        { "dtype": "float32", "shape": [1], "name": "dense_1/bias" }
      ]
    }
  ],
  "modelTopology": {
    "training_config": {
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "dtype": "float32",
              "name": "accuracy",
              "fn": "binary_accuracy"
            }
          }
        ]
      ],
      "loss": "binary_crossentropy",
      "optimizer_config": {
        "class_name": "RMSprop",
        "config": {
          "name": "RMSprop",
          "decay": 0.0,
          "centered": false,
          "epsilon": 1e-7,
          "learning_rate": 0.0010000000474974513,
          "rho": 0.8999999761581421,
          "momentum": 0.0
        }
      },
      "weighted_metrics": null,
      "loss_weights": null
    },
    "keras_version": "2.5.0",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "ragged": false,
              "dtype": "float32",
              "batch_input_shape": [null, 200, 200, 3],
              "name": "conv2d_input",
              "sparse": false
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "groups": 1,
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "name": "conv2d",
              "bias_regularizer": null,
              "bias_constraint": null,
              "dtype": "float32",
              "activation": "relu",
              "trainable": true,
              "data_format": "channels_last",
              "padding": "valid",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "kernel_regularizer": null,
              "filters": 16,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "batch_input_shape": [null, 200, 200, 3],
              "use_bias": true,
              "activity_regularizer": null,
              "kernel_size": [3, 3]
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d",
              "dtype": "float32",
              "trainable": true,
              "data_format": "channels_last",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2]
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "groups": 1,
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "name": "conv2d_1",
              "bias_regularizer": null,
              "bias_constraint": null,
              "dtype": "float32",
              "activation": "relu",
              "trainable": true,
              "data_format": "channels_last",
              "padding": "valid",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "kernel_regularizer": null,
              "filters": 32,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "use_bias": true,
              "activity_regularizer": null,
              "kernel_size": [3, 3]
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_1",
              "dtype": "float32",
              "trainable": true,
              "data_format": "channels_last",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2]
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "groups": 1,
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "name": "conv2d_2",
              "bias_regularizer": null,
              "bias_constraint": null,
              "dtype": "float32",
              "activation": "relu",
              "trainable": true,
              "data_format": "channels_last",
              "padding": "valid",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "kernel_regularizer": null,
              "filters": 64,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "use_bias": true,
              "activity_regularizer": null,
              "kernel_size": [3, 3]
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_2",
              "dtype": "float32",
              "trainable": true,
              "data_format": "channels_last",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2]
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "groups": 1,
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "name": "conv2d_3",
              "bias_regularizer": null,
              "bias_constraint": null,
              "dtype": "float32",
              "activation": "relu",
              "trainable": true,
              "data_format": "channels_last",
              "padding": "valid",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "kernel_regularizer": null,
              "filters": 64,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "use_bias": true,
              "activity_regularizer": null,
              "kernel_size": [3, 3]
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_3",
              "dtype": "float32",
              "trainable": true,
              "data_format": "channels_last",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2]
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "groups": 1,
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "name": "conv2d_4",
              "bias_regularizer": null,
              "bias_constraint": null,
              "dtype": "float32",
              "activation": "relu",
              "trainable": true,
              "data_format": "channels_last",
              "padding": "valid",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "kernel_regularizer": null,
              "filters": 64,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "use_bias": true,
              "activity_regularizer": null,
              "kernel_size": [3, 3]
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_4",
              "dtype": "float32",
              "trainable": true,
              "data_format": "channels_last",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2]
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "dtype": "float32",
              "trainable": true,
              "name": "flatten",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "name": "dense",
              "bias_regularizer": null,
              "bias_constraint": null,
              "dtype": "float32",
              "activation": "relu",
              "trainable": true,
              "kernel_constraint": null,
              "kernel_regularizer": null,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "units": 512,
              "use_bias": true,
              "activity_regularizer": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "name": "dense_1",
              "bias_regularizer": null,
              "bias_constraint": null,
              "dtype": "float32",
              "activation": "sigmoid",
              "trainable": true,
              "kernel_constraint": null,
              "kernel_regularizer": null,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "units": 1,
              "use_bias": true,
              "activity_regularizer": null
            }
          }
        ],
        "name": "sequential"
      }
    },
    "backend": "tensorflow"
  },
  "generatedBy": "keras v2.5.0",
  "convertedBy": "TensorFlow.js Converter v3.11.0",
  "format": "layers-model"
}
